import { IVideo } from '../types';

export const movieRaws: Omit<IVideo, 'id' | 'type'>[] = [
  {
    title: 'Твоё имя',
    desc: 'Мицуха Миямидзу — обычная девушка, уставшая от жизни в провинции. Её отец, мэр города, ведёт избирательную кампанию, а в семейном синтоистском храме ей приходится прилюдно исполнять древние ритуалы. И она мечтает перебраться из тесного провинциального мирка в большой город.Таки Татибана — увлекающийся архитектурой старшеклассник, вынужденный работать на полставки, чтобы обеспечивать свою жизнь в Токио. Изнурённый темпом большого города, Татибана мечтает о беззаботной жизни где-нибудь в горах.Однажды герои обнаруживают, что между ними существует странная и необъяснимая связь. Во сне они меняются телами и проживают жизни друг друга. Но однажды эта способность исчезает так же внезапно, как появилась. Таки решает во что бы то ни стало отыскать Мицуху, но способны ли они узнать друг друга в реальной жизни?',
    previewUrl:
      'https://animelib.me/uploads/anime/11126/cover/f70781e3-2e4a-412c-ade1-18008b946218.jpg',
    url: 'https://video1.anilib.me//uploads/converted_videos/324/324_1080.mp4',
  },
  {
    title: 'Ходячий замок',
    desc: 'Восемнадцатилетняя шляпница Софи ведёт тихую и ничем не примечательную городскую жизнь. Однако типичный её распорядок рушится, когда в окрестностях города объявляется Ходячий замок Хаула — колдуна, заключившего сделку с демоном огня Кальцифером и носящего дурную славу «похитителя» девичьих сердец.Вечером после работы очаровательный голубоглазый красавец, оказавшийся, как ни странно, самим Хаулом , спасает Софи от приставаний двух солдафонов, и девушка тут же влюбляется в своего спасителя. Однако итогом их встречи становится проклятие Ведьмы Пустоши , превратившее Софи в девяностолетнюю старуху.Теперь Софи вынуждена покинуть родной дом и отправиться на поиски ведьмы, просить ту снять проклятие. Дорога же приводит «девушку» к тому самому Ходячему замку, где у неё и появляется шанс начать новую жизнь...',
    previewUrl:
      'https://animelib.me/uploads/anime/405/cover/2585e335-7f5e-4f88-9728-2f529266c342.jpg',
    url: 'https://carbon.cloud.kodik-cdn.com/animes/a98fe566a2964ca9ebbe03451fbbf772a10eea99/8af060f5fbf514eaba48c04d451cb377:2023050818/720.mp4',
  },
  {
    title: 'Панда большая и маленькая',
    desc: 'Мимико — маленькая девочка, которая осталась без родителей, после чего её воспитанием занялась бабушка. Пока бабушка отсутствовала, во двор к Мимико забрёл маленький детёныш панды — Пан, после, в поисках сына пришёл и Папа-панда. Узнав о том, что девочка живёт одна, Папанда решает сделать Мимико своей дочерью.Так начинается история Панды большой, маленькой и девочки человеческой.',
    previewUrl:
      'https://animelib.me/uploads/anime/2399/cover/15c42776-c8bb-421f-8621-be17323e7578.jpg',
    url: 'https://flora.cloud.kodik-storage.com/useruploads/9818fe0c-4585-4c03-a8a4-51bf39b359dc/80e9528d5d71d644020e5787e26ae81d:2023050818/720.mp4',
  },
  {
    title: 'Возвращение кота',
    desc: 'Хару самая обыкновенная школьница — она не блещет неземной красотой, у неё нет особых способностей. Хару не в состоянии принимать важные решения и всегда колеблется, обычно подчиняясь решению других людей. И вот эта девочка первый раз совершила в своей жизни настоящий поступок — рискуя жизнью, она спасла кошку из-под колёс грузовика.Каково же было её удивление, когда кот встал на задние лапы и поблагодарил её! А ещё предложил стать своей женой! Хару, конечно же, отказалась и убежала от странного животного. Но тот нашёл способ перенести девочку в свою кошачью страну. Теперь Хару предстоит выбраться оттуда в человеческий мир, а в этом ей помогут хвостатые и усатые друзья: бродяга Мута и гордый Барон .',
    previewUrl:
      'https://animelib.me/uploads/anime/561/cover/9042bc93-5825-4501-bded-6609ff3ea5e3.jpg',
    url: 'https://sicarus.cloud.kodik-storage.com/useruploads/1ac3c6c6-352c-4923-ba06-300cea86f74e/bd6d820a2a08f59d6ac1b49b8dfff1f3:2023050818/720.mp4',
  },
  {
    title: 'В лес, где мерцают светлячки',
    desc: 'Шестилетняя девочка Хотару заблудилась в заколдованном лесу. Она встречает юношу в маске по имени Гин , представившегося лесным духом, который может растаять от одного прикосновения человека. С помощью нового друга Хотару выбралась из леса, но на следующий день вернулась, чтобы вновь встретиться с Гином…',
    previewUrl:
      'https://animelib.me/uploads/anime/6141/cover/ef01dac5-44de-48cc-8c66-8d30938185f4.jpg',
    url: 'https://video1.anilib.me//uploads/converted_videos/3471/3471_1080.mp4',
  },
  {
    title: 'Со склонов Кокурико',
    desc: 'История разворачивается в 60-х годах 20 века. Для Японии это время обновления: многие хотят проститься с прошлым, со старыми зданиями и вещами, ведь они напоминают людям о тяжёлых послевоенных временах. В одном городке есть старое здание, в котором уже давно собираются различные школьные клубы по интересам. За много лет особняк полностью обветшал, поэтому многие горожане выступают за то, чтобы снести его. Но против этого выступают школьные активисты, в числе которых ученица Уми Мацузаки , член школьной газеты Шун Казама и президент студенческого совета Широ Мизунума . При помощи других учеников они стараются сохранить старое здание и часть своей истории, которую они не желают терять. Им придется отправиться в Токио, к руководителю школы Токумару , чтобы убедить его сохранить здание, на уборку и ремонт которого они потратили неимоверное количество сил. С этого и начинается дружба между Шуном и Уми, которая со временем, возможно, перерастает в нечто большее.Уми — застенчивая девушка, отец которой погиб во время войны, но она все еще надеется на его возвращение и каждый день поднимает флажки на заднем дворе своего дома. И все бы хорошо, но совершенно случайно ей становится известна одна история из военного прошлого, когда людям приходилось идти на трудные и подчас нелёгкие поступ',
    previewUrl:
      'https://animelib.me/uploads/anime/5973/cover/46300e57-b485-4dce-adf4-03aa74c20eff.jpg',
    url: 'https://sagitta.cloud.kodik-storage.com/useruploads/c0e97ab0-3e68-4cac-a71a-c742be7a2c65/81ac496ab120e52f2e627bf0f52e2c99:2023050820/720.mp4',
  },

  {
    title: 'Воспоминания о Марни',
    desc: 'Анна Сасаки — необщительная девочка, у которой нет друзей. Она живёт у приёмных родителей, страдает от астмы и любит рисовать. В конце концов Анна переезжает в небольшой провинциальный городок погостить у Киёмасы и Сэцу Оива — родственников Ёрико , приёмной матери девочки.Но всё не так скучно и однообразно, как может показаться на первый взгляд! В городке есть загадочное поместье «Дом на отмели», которое постоянно привлекает внимание Анны. Вскоре героиня встречает Марни, живущую в этом прекрасном доме. Девочки быстро становятся подругами, но однажды Марни исчезает, а в дом въезжают новые владельцы — семья Саяки . И тогда Анна начинает узнавать о своей подруге кое-что новое и странное.',
    previewUrl:
      'https://animelib.me/uploads/anime/8421/cover/8c795ed9-a63e-43d1-9457-1d3d9062acad.jpg',
    url: 'https://sparta.cloud.kodik-storage.com/useruploads/d427dea0-0f6b-49e9-b3e8-f55f862abc2f/cdbd65b159ca09c5193b136fda1b22e8:2023050820/720.mp4',
  },
  {
    title: 'Мэри и ведьмин цветок',
    desc: 'История, основанная на детском рассказе «Маленькая метла» за авторством английской писательницы Мэри Стюарт.Однажды, жизнь юной Мэри Смит переворачивается с ног на голову. Происходит это, когда чёрный кот по имени Тиб приводит её к странному цветку, что находится в глубине леса. Вскоре после любования цветком девочка обнаруживает маленькую метлу, которая внезапно поднимает её в воздух. Не успела Мэри опомниться, как неугомонная метла пронесла её по верхушкам деревьев, сквозь облака, а затем высадила прямо к подножию колледжа волшебства Эндор, где Мэри приняли за новую ученицу. После того, как героиня с трудом вернулась домой, она поняла, что по её вине ведьмы похитили соседского мальчика Питера , и Мэри приходится снова воспользоваться силой магического цветка.',
    previewUrl:
      'https://animelib.me/uploads/anime/12293/cover/1b79f26d-b6c0-49e8-8dbc-95f71d8c7313.jpg',
    url: 'https://aurum.cloud.kodik-cdn.com/animes/a8c8a440edf77ff4d72f2fe3cc7a5e089ba1dedb/24a8caa88d0c090ac0a2d77f8b81063e:2023050820/480.mp4',
  },
  {
    title: 'Чей-то взгляд',
    desc: 'Со временем вещи становятся обыденными и скучными. И тогда человек забывает о том, что в жизни является на самом деле значимым и важным. Очень часто мы не осознаём, чем выступает истинная любовь близких и родных людей. И осознание это зачастую приходит к нам лишь в трагический момент, когда мы навсегда теряем того, кто всё это время шёл рядом с вами по дороге жизни...',
    previewUrl:
      'https://animelib.me/uploads/anime/7532/cover/a00ee536-7089-429d-bc69-781930a2b826.jpg',
    url: 'https://polonium.cloud.kodik-storage.com/useruploads/ba291b3b-0b30-4c7f-8430-fb527625bada/c8b87a49dd649f2ed26201f4e200ce2b:2023050820/720.mp4',
  },
  {
    title: 'Дрейфующий дом',
    desc: 'Главных персонажей этого аниме зовут Косукэ и Нацумэ. Они ещё детского возраста продолжали длительное время общаться. Мальчишки потом перешли учиться в шестой класс. В их отношениях появилась натянутость. Потом они совершенно решили разорвать свои отношения. Скоро наступили долгожданные летние каникулы. Судьбе захотелось преподнести им неожиданный подарок. Потому бывшие приятели опять встретились. Они приняли решение отправиться к дому, который хотели сносить. В этом доме прошёл весь период их детства. Потому на приятелей сразу нахлынули многие воспоминания.Друзья придумали себе развлечение и начали играть. Потом, как они узнали, произошло появление странного события. Школьники не сразу могли опомниться. Когда сознание к ним вернулось, они поняли, что попали в открытое море и начали дрейфовать. Теперь необходимо придумать план, каким образом возвратиться назад. С друзьями этим временем произойдёт довольно много незабываемых приключений. Им будет потом про что вспомнить, когда они перейдут в седьмой класс. Летом всегда происходит много непредсказуемый событий. Потому совершенно нет места для скуки. Зачем попусту тратить время, когда кругом полно интересных мест.',
    previewUrl:
      'https://animelib.me/uploads/anime/19330/cover/4bbd26dc-2b53-43f9-8465-9754fc23e002.jpg',
    url: 'https://video1.anilib.me//uploads/converted_videos/2034/2034_1080.mp4',
  },
  {
    title: 'Мадагаскар',
    desc: 'Четверо изнеженных животных из Центрального зоопарка в Нью-Йорке - лев Алекс, зебра Марти, жираф Мелман и гиппопотамиха Глория - решаются на побег. Оказавшись после кораблекрушения на экзотическом острове Мадагаскар, населенном лемурами и поедающими их фоссами, путешественники с ужасом понимают, что с городскими привычками им придется распрощаться.Здесь нет людей, любимых клеток, вкусной кормежки. Начинается шоу «Последний герой» только с животными - нашим друзьям нужно выжить в непривычной среде обитания, где на каждом шагу подстерегает опасность...',
    previewUrl:
      'https://static.hdrezka.ac/i/2014/4/22/k8b31b6fd2409vd41s82p.jpg',
    url: 'https://loki.stream.voidboost.cc/95a4148146a03881cbb9f7278c1b4c4a:2023050908:c389d612-1d40-48fc-aa34-af5ddf1b74d3/2/0/6/6/0/2/fsqo6.mp4',
  },
];
